controllers/FileController.php

    public function actionDownload($id){
        $file = File::findOne($id);
---
SELECT * FROM `tower`.`file` WHERE `id`='11'