controllers/ProjectController.php

    public function actionIndex($id){
        /** @var Project $project */
        $project=Project::find()
            ->with("commonItems.commonTasks.user")
            ->where(["id"=>$id])
            ->one();
        $users=User::find()
            ->innerJoinWith("userTeams")
            ->where(["user_team.teamID"=>$project->teamID])
            ->all();
        $discusses = Discuss::find()->innerJoinWith(["relevance"])->where([
            "relevance.prevModel"=>G::PROJECT,
            "relevance.prevValue" => $id,
            "archive"=>0,
            "deleted" => G::DELETED_NOT,
        ])->orderBy("`order` desc,`update` desc")->limit(5)->all();
        $dirs=Dir::find()
            ->where(["projectID"=>$id, "parentID" =>0,])
            ->orderBy("`update` desc")
            ->limit(10)->all();
        $files=File::find()->where([
            "projectID"=>$id,
            "dirID"=>0,
            "deleted"=>0,
        ])->orderBy("`update` desc")->limit(10)->all();
        $multiples = array_reverse(G::sortByUpdate(array_merge($dirs, $files)));
        $multiples = array_slice($multiples, 0, 10);
        $date=date("Y-m-d 00:00:00");
        $events=Event::find()
            ->innerJoinWith(["calendar"])
            ->where(["calendar.projectID"=>$id])
            ->andWhere("event.start <= '$date' and '$date' <= event.end")
            ->limit(4)->all();
        $docs=Doc::find()
            ->where(["projectID"=>$id])
            ->orderBy("`update` desc")
            ->limit(6)->all();
        $items=$project->getCommonItems()->orderBy("id desc")->all();
---
SELECT * FROM `base`.`user` WHERE `id` IN (1, 0)
SELECT * FROM `tower`.`item` WHERE (`projectID`=1) AND (item.deleted = 0 and item.archive = 0 )
SELECT * FROM `tower`.`project` WHERE `id`='1'
SELECT * FROM `tower`.`task` WHERE (`itemID` IN (2, 21, 31, 32, 45, 46)) AND (task.status != 3 AND task.deleted = 0)
SELECT * FROM `tower`.`user_team` WHERE `userID` IN (1, 2, 3)
SELECT `base`.`user`.* FROM `base`.`user` INNER JOIN `tower`.`user_team` ON `base`.`user`.`id` = `tower`.`user_team`.`userID` WHERE `user_team`.`teamID`=1
SELECT `tower`.`discuss`.* FROM `tower`.`discuss` INNER JOIN `tower`.`relevance` ON `tower`.`discuss`.`model` = `tower`.`relevance`.`model` AND `tower`.`discuss`.`value` = `tower`.`relevance`.`value` WHERE (`relevance`.`prevModel`=3) AND (`relevance`.`prevValue`='1') AND (`archive`=0) AND (`deleted`=0) ORDER BY `order` DESC, `update` DESC LIMIT 5
SELECT * FROM `tower`.`dir` WHERE (`projectID`='1') AND (`parentID`=0) ORDER BY `update` DESC LIMIT 10
SELECT * FROM `tower`.`file` WHERE (`projectID`='1') AND (`dirID`=0) AND (`deleted`=0) ORDER BY `update` DESC LIMIT 10
SELECT `tower`.`event`.* FROM `tower`.`event` INNER JOIN `tower`.`calendar` ON `tower`.`event`.`calendarID` = `tower`.`calendar`.`id` WHERE (`calendar`.`projectID`='1') AND (event.start <= '2016-06-17 00:00:00' and '2016-06-17 00:00:00' <= event.end) LIMIT 4
SELECT * FROM `tower`.`doc` WHERE `projectID`='1' ORDER BY `update` DESC LIMIT 6
SELECT * FROM `tower`.`item` WHERE (`projectID`=1) AND (item.deleted = 0 and item.archive = 0 ) ORDER BY `id` DESC