controllers/TeamController.php

SELECT * FROM `tower`.`team` WHERE `id`='1'
SELECT `tower`.`project`.* FROM `tower`.`project` INNER JOIN `tower`.`user_project` ON `tower`.`project`.`id` = `tower`.`user_project`.`projectID` WHERE (`project`.`teamID`='1') AND (`user_project`.`userID`=1) AND (`template`=0) AND (`archive`=0) ORDER BY `sort` DESC
---
    public function actionProjects($id){
        $this->validate(TeamForm::VIEW);
        $team = Team::findOne($id);
        $projects=Project::find()->innerJoinWith(["userProjects"])->where([
            "project.teamID"=>$id,
            "user_project.userID"=>\Yii::$app->user->id,
            "template"=>0,
            "archive"=>0,
        ])->orderBy("sort desc")->all();

SELECT * FROM `tower`.`user_team` WHERE (`userID`=1) AND (`teamID`='1')
UPDATE `tower`.`user_team` SET `activeTime`='2016-06-19 11:32:35' WHERE `id`=1
---
    private function updateUserTeam($id){
        $userTeam = UserTeam::findOne(["userID" => \Yii::$app->user->id, "teamID" => $id]);
        $userTeam->activeTime=date("Y-m-d H:i:s");
        return $userTeam->save();