models/form/TeamForm.php

SELECT * FROM `tower`.`user_team` WHERE (`userID`=1) AND (`teamID`='1')
---
    public function checkAuth($attribute,$params){
        if(is_numeric($this->id)){
            if(!UserTeam::findOne(["userID"=>\Yii::$app->user->id,"teamID"=>$this->id])){

SELECT * FROM `tower`.`team` WHERE `id`='1'
---
    public function getTeam(){
        if($this->_team===false){
            $this->_team = Team::findOne($this->id);