models/Dir.php

    public function getIsEmpty(){
        $dirs=$this->getTrees();
        $dirIDs = ArrayHelper::getColumn($dirs, "id");
        return !File::find()->where(["dirID"=>$dirIDs,"deleted"=>0])->exists();
---
SELECT 1 FROM `tower`.`file` WHERE (`dirID` IN (29, 32)) AND (`deleted`=0)

    public function getDescendants(){
        return Dir::find()->where("link like '".($this->link.$this->id)."-"."%'")->all();
---
SELECT * FROM `tower`.`dir` WHERE link like '-33-%'