models/Discuss.php

    public function getCommentCount(){
        if($this->_commentCount===false){
            $this->_commentCount=Comment::find()->where([
                "model"=>$this->model,
                "value"=>$this->value,
            ])->count();
---
SELECT COUNT(*) FROM `tower`.`comment` WHERE (`model`=4) AND (`value`=52)

    public function getActiveText(){
        /** @var Comment $comment */
        $comment=Comment::find()->where([
            "model"=>$this->model,
            "value"=>$this->value,
        ])->orderBy("id desc")->one();
---
SELECT * FROM `tower`.`comment` WHERE (`model`=4) AND (`value`=52) ORDER BY `id` DESC