models/Project.php

SELECT COUNT(*) FROM `tower`.`user_project` WHERE `projectID`=1
---
    public function getMemberCount(){
        return UserProject::find()->where(["projectID"=>$this->id])->count();