models/Task.php

    public function getCommentCount(){
        if ($this->_commentCount === false) {
            $this->_commentCount = Comment::find()->where([
                "model" => G::TASK,
                "value" => $this->id,
            ])->count();
---
SELECT COUNT(*) FROM `tower`.`comment` WHERE (`model`=1) AND (`value`=37)